from django.urls import path
from . import views


# =========================================================
# urlpatterns
# =========================================================
# זו רשימת הכתובות (URLs) של האפליקציה missions.
#
# כל שורה אומרת:
# - מה הכתובת
# - איזו view תטפל בה
# - מה השם הפנימי של הכתובת
#
# השם הפנימי חשוב כדי שנוכל להשתמש ב-redirect()
# ובקישורים בתוך תבניות HTML בלי לכתוב כתובת ידנית.
# =========================================================
urlpatterns = [

     # עמוד הבית יוביל לגלריה
    path("", views.gallery, name="home"),

    # -----------------------------------------------------
    # upload/
    # -----------------------------------------------------
    # זו הכתובת של טופס העלאת קובץ.
    #
    # אם מישהו ייכנס ל:
    # /upload/
    #
    # Django יפעיל את view בשם upload_submission
    # -----------------------------------------------------
    path("upload/", views.upload_submission, name="upload_submission"),

    # -----------------------------------------------------
    # success/
    # -----------------------------------------------------
    # זו הכתובת של עמוד ההצלחה.
    #
    # אחרי שליחה תקינה של הטופס,
    # נעביר את המשתמש לכתובת הזו.
    # -----------------------------------------------------
    path("success/", views.submission_success, name="submission_success"),

    # -----------------------------------------------------
    # gallery/
    # -----------------------------------------------------
    # זו הכתובת של הגלריה הציבורית.
    #
    # שם נציג רק קבצים שאושרו.
    # -----------------------------------------------------
    path("gallery/", views.gallery, name="gallery"),

    path("password/", views.password_gate, name="password_gate"),
]
